ЛИС2/src/Documents/ВводОборудованияВЭксплуатацию/ВводОборудованияВЭксплуатацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОборудованияВЭксплуатацию</name>
  <registerRecords>AccumulationRegister.лис_ИмуществоЛабораторий</registerRecords>
  <registerRecords>InformationRegister.ЛабораторноеОборудованиеВЭксплуатации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.лис_ЛабораторноеОборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаводскойНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаводскоеОбозначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаспортаНаОборудование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзготовления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/AccumulationRegisters/лис_ИмуществоЛабораторий/лис_ИмуществоЛабораторий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>лис_ИмуществоЛабораторий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.лис_ВидыОперацийПриходаИмущества</types>
      <types>EnumRef.лис_ВидыОперацийРасходаИмущества</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.лис_ЛабораторныеРеактивы</types>
      <types>CatalogRef.Прекурсоры</types>
      <types>CatalogRef.лис_ЛабораторныеПринадлежности</types>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/ВводОборудованияВЭксплуатацию/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.лис_ИмуществоЛабораторий.Записывать = Истина;
	Движения.ЛабораторноеОборудованиеВЭксплуатации.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводОборудованияВЭксплуатациюСписокОборудования.Оборудование,
	|	ВводОборудованияВЭксплуатациюСписокОборудования.ИнвентарныйНомер,
	|	ВводОборудованияВЭксплуатациюСписокОборудования.ЗаводскойНомер,
	|	ВводОборудованияВЭксплуатациюСписокОборудования.ЗаводскоеОбозначение,
	|	ВводОборудованияВЭксплуатациюСписокОборудования.НомерПаспортаНаОборудование,
	|	ВводОборудованияВЭксплуатациюСписокОборудования.ДатаИзготовления,
	|	ВводОборудованияВЭксплуатациюСписокОборудования.Оборудование.СрокЭксплуатации КАК СрокЭксплуатации,
	|	ВводОборудованияВЭксплуатациюСписокОборудования.РегистрационныйНомер
	|ИЗ
	|	Документ.ВводОборудованияВЭксплуатацию.СписокОборудования КАК ВводОборудованияВЭксплуатациюСписокОборудования
	|ГДЕ
	|	ВводОборудованияВЭксплуатациюСписокОборудования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.лис_ИмуществоЛабораторий.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Лаборатория = Лаборатория;
		Движение.Объект = Выборка.Оборудование;
		Движение.ДатаИзготовления = Выборка.ДатаИзготовления;
		Движение.Количество = 1;
		
		Движение = Движения.ЛабораторноеОборудованиеВЭксплуатации.Добавить();
		Движение.Организация = Организация;
		Движение.Лаборатория = Лаборатория;
		Движение.ДатаВводаВЭксплуатацию = Дата;
		Движение.СрокДопустимойЭксплуатации = ДобавитьМесяц(Дата, Выборка.СрокЭксплуатации);
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	-лис_ИмуществоЛабораторийОстатки.КоличествоОстаток КАК Превышение,
	|	лис_ИмуществоЛабораторийОстатки.Лаборатория,
	|	лис_ИмуществоЛабораторийОстатки.Организация,
	|	лис_ИмуществоЛабораторийОстатки.Объект.Представление КАК Оборудование
	|ИЗ
	|	РегистрНакопления.лис_ИмуществоЛабораторий.Остатки(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И Лаборатория = &Лаборатория) КАК лис_ИмуществоЛабораторийОстатки
	|ГДЕ
	|	лис_ИмуществоЛабораторийОстатки.КоличествоОстаток < 0";
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Лаборатория", Лаборатория);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Недостаточно оборудования " + Выборка.Оборудование + " в лаборатории " + Выборка.Лаборатория + " (организация: " + Выборка.Организация +
						") в количестве " + Выборка.Превышение; 
		Сообщение.Сообщить();
		Отказ = Истина;		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	
КонецПроцедуры
